/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec-tillegg";
"06 06 02 82 06 01 0A 01"		= "Telesec-mekanisme";

"06 07 02 82 06 01 0A 01 00"	= "Telesec-godkjenning";
"06 08 02 82 06 01 0A 01 00 01"	= "Passordgodkjenning";
"06 08 02 82 06 01 0A 01 00 02" = "Beskyttet passordgodkjenning";
"06 08 02 82 06 01 0A 01 00 03" = "En-veis X.509-godkjenning";
"06 08 02 82 06 01 0A 01 00 04" = "To-veis X.509-godkjenning";
"06 08 02 82 06 01 0A 01 00 05" = "Tre-veis X.509-godkjenning";
"06 08 02 82 06 01 0A 01 00 06" = "En-veis ISO9798-godkjenning";
"06 08 02 82 06 01 0A 01 00 07" = "To-veis ISO9798-godkjenning";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom-godkjenning";

"06 07 02 82 06 01 0A 01 01"	= "Telesec-signatur";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 med RSA og ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 med RSA og Telesec-signaturstandard";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 med RSA og ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 med RSA og Telesec-signaturstandard";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 med RSA og Telekom-signaturstandard";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA-signatur";

"06 07 02 82 06 01 0A 01 02"	= "Telesec-kryptering";
"06 08 02 82 06 01 0A 01 02 00"	= "ingen";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "En-veisfunksjon";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "«Hash» med Block-siffer";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC-funksjon";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec-modul";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmer";
"06 07 02 82 06 01 0A 02 01"	= "Attributtyper";
"06 07 02 82 06 01 0A 02 02"	= "Sertifikattyper";
"06 07 02 82 06 01 0A 02 03"	= "Meldingstyper";
"06 07 02 82 06 01 0A 02 04"	= "PL-protokoll";
"06 07 02 82 06 01 0A 02 05"	= "SME og komponenter av SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Nyttige definisjoner";
"06 07 02 82 06 01 0A 02 08"	= "STE-filer";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronisk bestilling";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP asymmetrisk program";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP basisprogram";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP-meldinger";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP tidsstempelprogram";

"06 06 02 82 06 01 0A 03"		= "Objektklasse";
"06 07 02 82 06 01 0A 03 00"	= "Telesec annet navn";
"06 07 02 82 06 01 0A 03 01"	= "Katalog";
"06 07 02 82 06 01 0A 03 02"	= "Katalogtype";
"06 07 02 82 06 01 0A 03 03"	= "Kataloggruppe";
"06 07 02 82 06 01 0A 03 04"	= "Katalogbruker";
"06 07 02 82 06 01 0A 03 05"	= "Symmetrisk nøkkeloppføring";

"06 06 02 82 06 01 0A 04"		= "Pakke";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Navnebinding";
"06 06 02 82 06 01 0A 07"		= "Attributt";
"06 07 02 82 06 01 0A 07 00"	= "Programgruppeidentifikator";
"06 07 02 82 06 01 0A 07 01"	= "Sertifikattype";
"06 07 02 82 06 01 0A 07 02"	= "Telesec-sertifikat";
"06 07 02 82 06 01 0A 07 03"	= "Sertifikatnummer";
"06 07 02 82 06 01 0A 07 04"	= "Sertifikattilbakekallingsliste";
"06 07 02 82 06 01 0A 07 05"	= "Opprettet dato";
"06 07 02 82 06 01 0A 07 06"	= "Utsteder";
"06 07 02 82 06 01 0A 07 07"	= "Navngivningsautoritet";
"06 07 02 82 06 01 0A 07 08"	= "Fellesnøkkelkatalog";
"06 07 02 82 06 01 0A 07 09"	= "Sikkerhetsdomene";
"06 07 02 82 06 01 0A 07 0A"	= "Emne";
"06 07 02 82 06 01 0A 07 0B"	= "Tidspunkt for tilbakekallelse";
"06 07 02 82 06 01 0A 07 0C"	= "Brukergruppereferanse";
"06 07 02 82 06 01 0A 07 0D"	= "Gyldighet";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Sikkerhetsmeldingsmiljø";
"06 07 02 82 06 01 0A 07 10"	= "Anonymisert fellesnøkkelkatalog";
"06 07 02 82 06 01 0A 07 11"	= "Gitt Telesec-navn";
"06 07 02 82 06 01 0A 07 12"	= "Navnetillegg";
"06 07 02 82 06 01 0A 07 13"	= "Telesec-postnummer";
"06 07 02 82 06 01 0A 07 14"	= "Navnekjennetegn";
"06 07 02 82 06 01 0A 07 15"	= "Telesec-sertifikatliste";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust-sertifikatliste";
"06 07 02 82 06 01 0A 07 17"	= "X.509-sertifikatliste";
"06 07 02 82 06 01 0A 07 18"	= "Utstedelsestidspunkt";
"06 07 02 82 06 01 0A 07 19"	= "Nummer på fysisk kort";
"06 07 02 82 06 01 0A 07 1A"	= "Filtype";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl-fil er arkiv";
"06 07 02 82 06 01 0A 07 1C"	= "E-postadresse";
"06 07 02 82 06 01 0A 07 1D"	= "Sertifikatmal-liste";
"06 07 02 82 06 01 0A 07 1E"	= "Katalognavn";
"06 07 02 82 06 01 0A 07 1F"	= "Katalogtypenavn";
"06 07 02 82 06 01 0A 07 20"	= "Kataloggruppenavn";
"06 07 02 82 06 01 0A 07 21"	= "Katalogbrukernavn";
"06 07 02 82 06 01 0A 07 22"	= "Tilbakekallingsflagg";
"06 07 02 82 06 01 0A 07 23"	= "Symmetrisk nøkkeloppføringsnavn";
"06 07 02 82 06 01 0A 07 24"	= "GL-nummer";
"06 07 02 82 06 01 0A 07 25"	= "GO-nummer";
"06 07 02 82 06 01 0A 07 26"	= "G-nøkkeldata";
"06 07 02 82 06 01 0A 07 27"	= "Z-nøkkeldata";
"06 07 02 82 06 01 0A 07 28"	= "KT-nøkkeldata";
"06 07 02 82 06 01 0A 07 2A"	= "KT-nøkkeldata";
"06 07 02 82 06 01 0A 07 33"	= "Tidspunkt for tilbakekallelsesgenerering";
"06 07 02 82 06 01 0A 07 34"	= "Ansvarstekst";

"06 06 02 82 06 01 0A 08"		= "Attributtgruppe";
"06 06 02 82 06 01 0A 09"		= "Handling";
"06 06 02 82 06 01 0A 0A"		= "Kunngjøring";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Sikkerhetsprogram";

"06 06 02 82 06 01 0A 0C"		= "Sert.- og CRL-tilleggsdefinisjoner";

"06 07 02 82 06 01 0A 0C 00"	= "Sert.-tillegg ansvarsbegrensningstillegg";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec-sertifikat-ID-tillegg";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec-policyidentifikator";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec-kriteriekvalifikator";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL filtrert tillegg";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL filtertillegg";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec-navngivninvsautoritetstillegg";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Bruker-ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822-postkasse";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Domenekomponent";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australsk firmanummer";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Sertifikater Australia-kriterieidentifikator";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet-kriterieidentifikator";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symmetrisk krypteringsalgoritme";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Høysikkerhets SEIS-kriterieidentifikator";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK-kriterieidentifikator";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT personlig identifikator";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57-modul";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1-sertifikatadministrering";
"06 06 2A 86 48 CE 38 02"		= "Vent-instruksjon";
"06 07 2A 86 48 CE 38 02 01"	= "Vent-instruksjon – Ingen";
"06 07 2A 86 48 CE 38 02 02"	= "Oppringningsutsteder";
"06 07 2A 86 48 CE 38 02 03"	= "Avvis";
"06 07 2A 86 48 CE 38 02 04"	= "Kjennetegn ved henting";
"06 06 2A 86 48 CE 38 03"		= "Attributt";
"06 06 2A 86 48 CE 38 03 01"	= "Motsignatur";
"06 06 2A 86 48 CE 38 03 02"	= "Attributtsertifikat";
"06 06 2A 86 48 CE 38 04"		= "Algoritme";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA-treff";
"06 07 2A 86 48 CE 38 04 03"	= "DSA med SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62-felttype";
"06 07 2A 86 48 CE 3D 01 01"	= "Primærfelt";
"06 07 2A 86 48 CE 3D 01 02"	= "Karakteristikk – to-felt";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Karakteristikk – to-basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomial basis";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomial basis";
"06 06 2A 86 48 CE 3D 02"		= "Fellesnøkkeltype";
"06 07 2A 86 48 CE 3D 02 01"	= "Elliptisk kurve fellesnøkkel";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42-felttype";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois-felt primært";
"06 06 2A 86 48 CE 3E 02"		= "Nummertype";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman fellesnøkkel";
"06 06 2A 86 48 CE 3E 03"		= "System";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman-statisk";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman kortvarig";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust-versjonsinformasjon";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE med MD5 og CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "Passordbasert MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust-bruker";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA-informasjon";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Attributtsertifikat";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP-kryptering (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP etikettspesifisert";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS-signatursystem";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 med RSA-kryptering";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA-kryptering";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman nøkkelavtale";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE med MD2 og DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE med MD5 og DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE med MD2 og RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE med MD5 og RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE med MD5 og XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE med SHA og DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Data";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Signert data";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Inkludert data";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Signert og inkludert data";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Sammendrag av data";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Kryptert data";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Data med attributter";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Kryptert privatnøkkel-info";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "E-postadresse";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Ustrukturert navn";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Innholdstype";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Sammendrag av melding";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Signerer tidspunkt";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Motsignatur";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Forespørselspassord";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Ustrukturert adresse";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Utvidede sertifikatattributter";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Utsteder og serienummer";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Passordkontroll";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Fellesnøkkel";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Signerer beskrivelse";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Tilleggsforespørsel";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME-muligheter";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Foretrekk signerte data";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Kan ikke dekryptere noen";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Kvitteringsforespørsel";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Kvittering";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Hint om innhold";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Postlistetilleggshistorikk";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME-moduler";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Kryptografisk meldingssyntaks";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Forbedrede sikkerhetstjenester";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME-objektidentifikator";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3-melding";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS elektronisk signatur 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS elektronisk signatur 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS elektronisk signaturkriterier 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS elektronisk signaturkriterier 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME-innholdstyper";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME godkjente attributter";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME-algoritmer";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME-sertifikatdistribusjon";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP-sertifikatdistribusjon";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME-signaturkriteriekvalifiserer";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME-signaturtypeidentifikator";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Originatorsignatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Domenesignatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Tilleggsattributter-signatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Evalueringssignatur";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME-egenskaper";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Foretrekk innvendig binær";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Vennlig navn (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Lokalnøkkel-ID (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Sertifikattyper (for PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509-sertifikat (for PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI-sertifikat (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL-typer (for PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (for PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 personlig informasjonsutvekslingssyntaks";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12-passordbaserte krypterings-ID-er";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE med SHA-1 og 128-bits RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE med SHA-1 og 40-bits RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE med SHA-1 og 3-nøkkel trippel DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE med SHA-1 og 2-nøkkel trippel DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE med SHA-1 og 128-bits RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE med SHA-1 og 40-bits RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK-ID-er";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8-nøkkelskjuling";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12-bag-ID-er";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12-nøkkelbag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12-sertifikat og CRL-bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 hemmelig bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 sikkert innhold-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 skjult nøkkelbag-ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12-sertifikatbag-ID-er";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509-sertifikat og CRL-bag-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI-sertifikatbag-ID-er";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12-passordbasert krypterings-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE med SHA-1 og 128-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE med SHA-1 og 40-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE med SHA-1 og trippel DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE med SHA-1 og 128-bits RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE med SHA-1 og 40-bits RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE med SHA-1 og RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE med SHA-1 og RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 inkluderte ID-er";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA-kryptering med 128-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA-kryptering med 40-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA-kryptering med trippel DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12-signatur-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA-signatur med SHA-1-sammendrag";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 versjon 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12-bag-ID-er";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12-nøkkelbag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 skjult nøkkelbag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12-sertifikatbag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12-CRL-bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 hemmelig bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 sikkert innhold-bag";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15-moduler";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15-attributter";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15-innholdstype";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15-innhold";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI-sammendragsalgoritme";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC med SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI-krypteringsalgoritme";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 med MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus ukjent kriterieidentifikator";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT bruker-til-bruker Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server-objektklasse";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Plasseringsadressering";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Klasseskjema";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Attributtskjema";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Postkasseagent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Postkasse";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Beholder";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Mottaker av post";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Leveringsmekanisme";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft-filformater";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC indirekte datakontekst";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC-firmainformasjon";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC-utsagnstype";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC-opusinformasjon";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC-sertifikattillegg";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE-bildedata";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC-link (type 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Individuell kodesignering";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Kommersiell kodesignering";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC-link (type 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC minimale kriterier";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC finansielle kriterier";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC-link (type 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM-sikkerhetsstøtteleverandør";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Motsignatur på tidsstempel";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Sertifikatgodkjenningsliste";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Sortert CTL-tillegg";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Neste oppdatering-plassering";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Forbedret nøkkel-bruk";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Sertifikatgodkjenningslistesignering";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Tidsstempelsignering";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Serialisert kryptering";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Krypterte filsystemer";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Kryptert filsystemgjenoppretting";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Kompatibel med Windows-maskinvare";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5-signering";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "OEM-signering for Windows-maskinvare";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Integrert NT-signering";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Sikker rotlistesignering";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Kvalifisert subordinering";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Nøkkelgjenfinning";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Dokumentsignering";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Attributtobjektidentifikatorer";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Ja/nei-godkjenningsattributt";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft musikk-DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM-individualisering";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft-lisenser";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft-lisenstjener";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10-objektidentifikatorer";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Fornyelsessertifikat";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Påmeldingsnavn/Verdipar";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Påmeldings-CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS-versjon";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12-attributter";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Lokal maskin-nøkkelsett";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft-påmeldingsinfrastruktur";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Auto-registrer CTL-bruk";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Påmeldingssertifikattype";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Påmeldingsagent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartkortpålogging";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT-prinsipalnavn";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft-sertifikattjenerinfrastruktur";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA-fornyelsesversjon";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM-versjon";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM-attributt";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Dokumentnavn";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Dokumentbeskrivelse";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Kryptert data";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Kryptert innhold";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT-kriterieidentifikator";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL-kriterieidentifikator";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA-kriterieidentifikator";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal med";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal med RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib-attributter";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib-tilstedeværelsekontroll";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP-respons-RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP-respons-RTCS utvidet";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL utvidet begrunnelse";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Nøkkelfunksjoner";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI-oppstart";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib-innhold";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib-konfigureringsdata";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib-brukerindeks";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib-brukerinformasjon";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY-kriterieidentifikator";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Tidsbevis";
"06 08 2B 06 01 04 01 AA 60 01"		= "Tidssignatursystem";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Tidssignatursystem 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Tidssignatursystem 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Tidssignatursystem 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Sekundære praksiser";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Legeidentifikatorer";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos-godkjenningsdata";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman-nøkkeldata";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos-svarnøkkeldata";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos-klientgodkjenning";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos Key Distribution Center (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Fellesnøkkelinfrastruktur";

"06 07 2B 06 01 05 05 07 01"		= "PKIX privat sertifikat-tillegg";
"06 08 2B 06 01 05 05 07 01 01"		= "Informasjonstilgang for sertifikatautoritet";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrisk informasjon";
"06 08 2B 06 01 05 05 07 01 03"		= "Kvalifiserte sertifikatutsagn";
"06 08 2B 06 01 05 05 07 01 04"		= "Attributtsertifikatkontrollidentitet";
"06 08 2B 06 01 05 05 07 01 05"		= "Attributtsertifikatmål";
"06 08 2B 06 01 05 05 07 01 06"		= "Attributtsertifikatautoritetkontroller";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP-adresseblokk";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP autonom systemidentifikator";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP-ruteridentifikator";
"06 08 2B 06 01 05 05 07 01 0A"		= "Attributtsertifikatproxying";
"06 08 2B 06 01 05 05 07 01 0B"		= "Informasjonstilgang for subjekt";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Kriteriekvalifikatortyper";
"06 08 2B 06 01 05 05 07 02 01"		= "Sertifikatpraksisutsagn";
"06 08 2B 06 01 05 05 07 02 02"		= "Brukervarsel";
"06 08 2B 06 01 05 05 07 02 03"		= "Tekstvarsel";

"06 07 2B 06 01 05 05 07 03"		= "Nøkkels hensikt";
"06 08 2B 06 01 05 05 07 03 01"		= "Tjenergodkjenning";
"06 08 2B 06 01 05 05 07 03 02"		= "Klientgodkjenning";
"06 08 2B 06 01 05 05 07 03 03"		= "Kodesignering";
"06 08 2B 06 01 05 05 07 03 04"		= "E-postbeskyttelse";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC-sluttsystem";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC-tunnel";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC-bruker";
"06 08 2B 06 01 05 05 07 03 08"		= "Tidsstempling";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP-signering";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA-tjenergodkjenning";

"06 07 2B 06 01 05 05 07 04"		= "CMP-informasjonstyper";
"06 08 2B 06 01 05 05 07 04 01"		= "CA-protokollkrypteringssertifikat";
"06 08 2B 06 01 05 05 07 04 02"		= "Signeringsnøkkelpartyper";
"06 08 2B 06 01 05 05 07 04 03"		= "Krypteringsnøkkelpartyper";
"06 08 2B 06 01 05 05 07 04 04"		= "Foretrukket symmetrisk algoritme";
"06 08 2B 06 01 05 05 07 04 05"		= "CA-nøkkeloppdateringsinformasjon";
"06 08 2B 06 01 05 05 07 04 06"		= "Nåværende CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "OID-er som ikke støttes";
"06 08 2B 06 01 05 05 07 04 08"		= "Abonneringsforespørsel";
"06 08 2B 06 01 05 05 07 04 09"		= "Abonneringssvar";
"06 08 2B 06 01 05 05 07 04 0A"		= "Nøkkelparparameterforespørsel";
"06 08 2B 06 01 05 05 07 04 0B"		= "Nøkkelparparameterrespons";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassordfrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF-registrering";
"06 08 2B 06 01 05 05 07 05 01"		= "Registreringskontroll";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registreringskjennetegn";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Godkjenner";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI-publiseringsinformasjon";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI-arkivvalg";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Gammel sertifikat-ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protokollkrypteringsnøkkel";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternativ sertifikatmal";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS-mal";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF-registreringsinformasjon";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8-par";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Sertifikatbestilling";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmer";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Ingen signatur";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC-kontroller";

"06 07 2B 06 01 05 05 07 08"		= "Andre navn";
"06 08 2B 06 01 05 05 07 08 01"		= "Personlige data";
"06 08 2B 06 01 05 05 07 08 02"		= "Brukergruppe";

"06 07 2B 06 01 05 05 07 09"		= "Personlige data";
"06 08 2B 06 01 05 05 07 09 01"		= "Fødselsdato";
"06 08 2B 06 01 05 05 07 09 02"		= "Fødested";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Kjønn";
"06 08 2B 06 01 05 05 07 09 05"		= "Statsborgerskap i land";
"06 08 2B 06 01 05 05 07 09 06"		= "Bosatt i land";

"06 07 2B 06 01 05 05 07 0A"		= "Attributtsertifikat";
"06 08 2B 06 01 05 05 07 0A 01"		= "Godkjenningsinformasjon";
"06 08 2B 06 01 05 05 07 0A 02"		= "Tilgangsidentitet";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identitet ved belastning";
"06 08 2B 06 01 05 05 07 0A 04"		= "Gruppe";
"06 08 2B 06 01 05 05 07 0A 05"		= "Rolle";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Sertifikatstatusprotokoll på Internett";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP-basisrespons";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce-tillegg";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL-referanse";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP-respons";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP Ingen tilbakekallelseskontroll";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP-arkiv-«cutoff»";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP-tjenestefinner";

"06 08 2B 06 01 05 05 07 30 02"		= "CA-utstedere";
"06 08 2B 06 01 05 05 07 30 03"		= "Tidsstempling";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE mellomnivå";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC-krypteringsalgoritme";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC-«Hash»-algoritme";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC-signaturalgoritme";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 med RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 med RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 med RSA";
"06 05 2B 0E 03 02 03"				= "MD5 med RSA";
"06 05 2B 0E 03 02 04"				= "MD4 med RSA-kryptering";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N med RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA-signatur";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA med SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 med RSA-signatur";
"06 05 2B 0E 03 02 0F"				= "SHA med RSA-signatur";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman med Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common med SHA";
"06 05 2B 0E 03 02 16"				= "RSA-nøkkeloverføring";
"06 05 2B 0E 03 02 17"				= "«Keyed-hash»-segl";
"06 05 2B 0E 03 02 18"				= "MD2 med RSA-signatur";
"06 05 2B 0E 03 02 19"				= "MD5 med RSA-signatur";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA med SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA med Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 med RSA-kryptering";
"06 05 2B 0E 03 03 01"				= "Enkel-sterk-godkj.-mekanisme";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 med RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 med ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokument";
"06 04 2B 24 01 01"					= "Endelig versjon";
"06 04 2B 24 01 02"					= "Utkast";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritme";
"06 04 2B 24 03 01"					= "Krypteringsalgoritme";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA-kryptering";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hash-algoritme";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 Single Length";
"06 05 2B 24 03 02 05"				= "MDC2 Double Length";
"06 04 2B 24 03 03"					= "Signaturalgoritme";
"06 05 2B 24 03 03 01"				= "RSA-signatur";

"06 06 2B 24 03 03 01 01"			= "RSA-signatur med SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA-signatur med SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA-signatur med SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA-signatur med SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA-signatur med SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA-signatur med SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA-signatur med SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA-signatur med SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA-signatur med SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA-signatur med SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA-signatur med SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA-signatur med SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA-signatur med SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA-signatur med SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA-signatur med SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA-signatur med SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA-signatur med SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA-signatur med SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA-signatur med SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA-signatur med SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA-signatur med SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA-signatur med SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA-signatur med SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA-signatur med SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA-signatur med SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA-signatur med SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA-signatur med RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA-signatur med RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA Signature med RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA-signatur med RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA-signatur med RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA-signatur med RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA-signatur med RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA-signatur med RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA-signatur med RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA-signatur med RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA-signatur med RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA-signatur med RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA-signatur med RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA-signatur med RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA-signatur med RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA-signatur med RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA-signatur med RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA-signatur med RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA-signatur med RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA-signatur med RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA-signatur med RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA-signatur med RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA-signatur med RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA-signatur med RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA-signatur med RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA-signatur med RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA-signatur med RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA-signatur med RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE-signatur";
"06 06 2B 24 03 03 02 01"			= "ECSIE-signatur med SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE-signatur med RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE-signatur med MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE-signatur med MD5";

"06 04 2B 24 03 04"					= "Signatursystem";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 med RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 med RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 med RND";

"06 03 2B 24 04"					= "Attributt";
"06 03 2B 24 05"					= "Kriterier";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Produsentspesifikk API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Funksjonalitetsspesifikk API";
"06 03 2B 24 07"					= "Nøkkeladministrering";
"06 04 2B 24 07 01"					= "Nøkkelavtale";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Overføring av nøkkel";
"06 05 2B 24 07 02 01"				= "ISO9796-2 med RSA-kryptering";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform-kriterieidentifikator";
"06 05 2B 24 08 02 01"				= "Katalogtjeneste";

"06 05 2B 24 08 03 01"				= "Dato for sertifikatopprettelse";
"06 05 2B 24 08 03 02"				= "Fullmakt";
"06 05 2B 24 08 03 03"				= "Tilgang";
"06 05 2B 24 08 03 04"				= "Pengebeløpsgrense";
"06 05 2B 24 08 03 05"				= "Deklarasjon av majoritet";
"06 05 2B 24 08 03 06"				= "Serienummer for integrert kretskort";
"06 05 2B 24 08 03 07"				= "Fellesnøkkelreferanse";
"06 05 2B 24 08 03 08"				= "Restriksjon";
"06 05 2B 24 08 03 09"				= "Hent hvis tillatt";
"06 05 2B 24 08 03 0A"				= "Anmodet sertifikat";
"06 05 2B 24 08 03 0B"				= "Navngivende autoriteter";
"06 05 2B 24 08 03 0C"				= "Sertifikat i katalog siden";
"06 05 2B 24 08 03 0D"				= "Sertifikat-«Hash»";

"06 05 2B 24 08 04 01"				= "Personlige data";
"06 05 2B 24 08 04 08"				= "Restriksjon";
"06 07 2B 24 08 05 01 01 01"		= "RSA indikerer SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA indikerer RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA med SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA med RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA utvidet";
"06 07 2B 24 08 05 01 02 02"		= "DSA med RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Sertifikat";
"06 05 2B 24 08 06 02"				= "Sertifikatreferanse";
"06 05 2B 24 08 06 03"				= "Attributtsertifikat";
"06 05 2B 24 08 06 04"				= "Attributtreferanse";
"06 05 2B 24 08 06 05"				= "Filnavn";
"06 05 2B 24 08 06 06"				= "Lagringstid";
"06 05 2B 24 08 06 07"				= "Filstørrelse";
"06 05 2B 24 08 06 08"				= "Sted";
"06 05 2B 24 08 06 09"				= "Signaturnummer";
"06 05 2B 24 08 06 0A"				= "Autogenerert";

"06 05 2B 24 08 07 01"				= "Teletrust-presentasjonstyper";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binær";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Tekst";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte-sertifikattillegg";
"06 05 2B 65 01 04 01"				= "Sterk Extranet";

/* X.520 */

"06 02 55 04"		= "X.520-attributtyper";
"06 03 55 04 00"	= "Objektklasse";
"06 03 55 04 01"	= "Alias for oppføringsnavn";
"06 03 55 04 02"	= "Kunnskapsinformasjon";
"06 03 55 04 03"	= "Navn (cn)";
"06 03 55 04 04"	= "Etternavn";
"06 03 55 04 05"	= "Serienummer";
"06 03 55 04 06"	= "Navn på land";
"06 03 55 04 07"	= "Navn på sted";
"06 04 55 04 07 01"	= "Kollektivt stedsnavn";
"06 03 55 04 08"	= "Navn på stat eller provins";
"06 04 55 04 08 01"	= "Kollektivt navn på stat eller provins";
"06 03 55 04 09"	= "Gateadresse";
"06 04 55 04 09 01"	= "Kollektiv gateadresse";
"06 03 55 04 0A"	= "Navn på organisasjon";
"06 04 55 04 0A 01"	= "Kollektivt navn på organisasjon";
"06 03 55 04 0B"	= "Navn på organisasjonsavdeling";
"06 04 55 04 0B 01"	= "Kollektivt navn på organisasjonsavdeling";
"06 03 55 04 0C"	= "Tittel";
"06 03 55 04 0D"	= "Beskrivelse";
"06 03 55 04 0E"	= "Søkeguide";
"06 03 55 04 0F"	= "Firmakategori";
"06 03 55 04 10"	= "Postadresse";
"06 04 55 04 10 01"	= "Kollektiv postadresse";
"06 03 55 04 11"	= "Postnummer";
"06 04 55 04 11 01"	= "Kollektivt postnummer";
"06 03 55 04 12"	= "Postboks";
"06 04 55 04 12 01"	= "Kollektiv postboks";
"06 03 55 04 13"	= "Kontornavn ved fysisk levering";
"06 04 55 04 13 01"	= "Kollektivt kontornavn ved fysisk levering";
"06 03 55 04 14"	= "Telefonnummer";
"06 04 55 04 14 01"	= "Kollektivt telefonnummer";
"06 03 55 04 15"	= "Teleksnummer";
"06 04 55 04 15 01"	= "Kollektivt teleksnummer";
"06 03 55 04 16"	= "Teletex-terminalidentifikator";
"06 04 55 04 16 01"	= "Kollektiv Teletex-terminalidentifikator";
"06 03 55 04 17"	= "Faksnummer";
"06 04 55 04 17 01"	= "Kollektivt faksnummer";
"06 03 55 04 18"	= "X.121-adresse";
"06 03 55 04 19"	= "Internasjonalt ISDN-nummer";
"06 04 55 04 19 01"	= "Kollektivt internasjonalt ISDN-nummer";
"06 03 55 04 1A"	= "Registrert adresse";
"06 03 55 04 1B"	= "Destinasjonsindikator";
"06 03 55 04 1C"	= "Foretrukket leveringsmetode";
"06 03 55 04 1D"	= "Presentasjonsadresse";
"06 03 55 04 1E"	= "Støttet programkontekst";
"06 03 55 04 1F"	= "Medlem";
"06 03 55 04 20"	= "Eier";
"06 03 55 04 21"	= "Rolleinnehaver";
"06 03 55 04 22"	= "Se også";
"06 03 55 04 23"	= "Brukerpassord";
"06 03 55 04 24"	= "Brukersertifikat";
"06 03 55 04 25"	= "CA-sertifikat";
"06 03 55 04 26"	= "Autoritetstilbakekallingsliste";
"06 03 55 04 27"	= "Sertifikattilbakekallingsliste";
"06 03 55 04 28"	= "Kryss sertifikatpar";
"06 03 55 04 29"	= "Navn";
"06 03 55 04 2A"	= "Fornavn navn";
"06 03 55 04 2B"	= "Initialer";
"06 03 55 04 2C"	= "Generasjonskvalifikator";
"06 03 55 04 2D"	= "Unik identifikator";
"06 03 55 04 2E"	= "DN-kvalifikator";
"06 03 55 04 2F"	= "Utvidet søkeguide";
"06 03 55 04 30"	= "Protokollinformasjon";
"06 03 55 04 31"	= "Unikt navn";
"06 03 55 04 32"	= "Unikt medlem";
"06 03 55 04 33"	= "Husidentifikator";
"06 03 55 04 34"	= "Støttede algoritmer";
"06 03 55 04 35"	= "Deltatilbakekallingsliste";
"06 03 55 04 36"	= "Klarering";
"06 03 55 04 3A"	= "Kryss sertifikatpar";

/* X.500 object classes */

"06 02 55 06"		= "X.520-objektklasse";
"06 03 55 06 00"	= "Top";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Land";
"06 03 55 06 03"	= "Sted";
"06 03 55 06 04"	= "Organisasjon";
"06 03 55 06 05"	= "Firmaenhet";
"06 03 55 06 06"	= "Person";
"06 03 55 06 07"	= "Person i organisasjonen";
"06 03 55 06 08"	= "Rolle i organisasjonen";
"06 03 55 06 09"	= "Gruppe av navn";
"06 03 55 06 0A"	= "Privatperson";
"06 03 55 06 0B"	= "Programprosess";
"06 03 55 06 0C"	= "Programenhet";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Enhet";
"06 03 55 06 0F"	= "Sterk godkjenning-bruker";
"06 03 55 06 10"	= "Sertifikatautoritet";
"06 03 55 06 11"	= "Gruppe av unike navn";
"06 03 55 06 15"	= "PKI-bruker";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500-algoritmer";
"06 03 55 08 01"	= "X.500-krypteringsalgoritmer";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509-sertifikattillegg";
"06 03 55 1D 01"	= "Nøkkelidentifikator for autoritet (gammel)";
"06 03 55 1D 02"	= "Primære nøkkelattributter (gammel)";
"06 03 55 1D 03"	= "Sertifikatkriterier (gammel)";
"06 03 55 1D 04"	= "Begrensninger av nøkkelbruk (gammel)";
"06 03 55 1D 05"	= "Kriterietilordning (gammel)";
"06 03 55 1D 06"	= "«Subtrees»-restriksjon";
"06 03 55 1D 07"	= "Alternativt navn for subjekt (gammel)";
"06 03 55 1D 08"	= "Alternativt navn for utsteder (gammel)";
"06 03 55 1D 09"	= "Katalogattributter for subjekt";
"06 03 55 1D 0A"	= "Basic Constraints (old 2.5.29.10)";
"06 03 55 1D 0B"	= "Navnerestriksjoner (gammel)";
"06 03 55 1D 0C"	= "Kriterierestriksjoner (gammel)";
"06 03 55 1D 0D"	= "Basic Constraints (old 2.5.29.13)";
"06 03 55 1D 0E"	= "Nøkkelidentifikator for subjekt";
"06 03 55 1D 0F"	= "Nøkkelbruk";
"06 03 55 1D 10"	= "Bruksperiode for privat nøkkel";
"06 03 55 1D 11"	= "Alternativt navn for subjekt";
"06 03 55 1D 12"	= "Alternativt navn for utsteder";
"06 03 55 1D 13"	= "Basisrestriksjoner";
"06 03 55 1D 14"	= "Sertifikattilbakekallingslistenummer";
"06 03 55 1D 15"	= "CRL-kode for årsak";
"06 03 55 1D 16"	= "Utløpsdato (gammel):";
"06 03 55 1D 17"	= "Hold tilbake instruksjonskode";
"06 03 55 1D 18"	= "Ugyldighetsdato";
"06 03 55 1D 19"	= "CRL-distribusjonspunkter (gammel)";
"06 03 55 1D 1A"	= "Distribusjonspunkt for utstedelse (gammel)";
"06 03 55 1D 1B"	= "Delta-CRL-indikator";
"06 03 55 1D 1C"	= "Distribusjonspunkt for utstedelse";
"06 03 55 1D 1D"	= "Sertifikatutsteder";
"06 03 55 1D 1E"	= "Navnerestriksjoner";
"06 03 55 1D 1F"	= "CRL-distribusjonspunkter";
"06 03 55 1D 20"	= "Sertifikatkriterier";
"06 04 55 1D 20 00"	= "Hvilken som helst kriterieidentifikator";
"06 03 55 1D 21"	= "Kriterietilordning";
"06 03 55 1D 22"	= "Kriterierestriksjoner";
"06 03 55 1D 23"	= "Nøkkelidentifikator for autoritet";
"06 03 55 1D 24"	= "Kriterierestriksjoner";
"06 03 55 1D 25"	= "Utvidet nøkkelbruk";
"06 04 55 1D 25 00"	= "Hvilken som helst utvidet nøkkelbruk";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS-signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza-signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS-konfidesialitetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza-konfidensialitetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS-integritetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza-integritetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS-kjennetegnbeskyttelsesalgoritme";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza-kjennetegnbeskyttelsesalgoritme";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS-nøkkeladministreringsalgoritme";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza-nøkkeladministreringsalgoritme";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS-nøkkeladministrerings- og -signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza-nøkkeladministrerings- og -signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A-signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A-konfidensialitetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A-integritetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A-kjennetegnbeskyttelsesalgoritme";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A-nøkkeladministreringsalgoritme";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A-nøkkeladministrerings- og -signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza oppdatert signaturalgoritme";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza-nøkkeladministrerings- og oppdaterte signaturalgoritmer";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza oppdatert integritetsalgoritme";
"06 09 60 86 48 01 65 02 01 01 16"	= "Nøkkelutvekslingsalgoritme";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80-algoritme";
"06 09 60 86 48 01 65 02 01 01 18"	= "Nøkkelkrypteringsalgoritme (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822-meldingsformat";
"06 09 60 86 48 01 65 02 01 02 02"	= "Tomt innhold";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP-innholdstype";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3-innholdstype";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP-innholdstype";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey-agentprotokoll";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1-innholdstype";
"06 09 60 86 48 01 65 02 01 02 48"	= "Videresendt del av MSP-melding";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parametere for videresendt MSP-melding";
"06 09 60 86 48 01 65 02 01 02 50"	= "Videresendt del av CSP-melding";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parametere for videresendt CSP-melding";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS-sikkerhetskriterier";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Sikkerhetskriterier";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Generisk";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Standard sikkerhetskriterier";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS-nøkkeladministreringssertifikat";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS-brukersignatursertifikat";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS-nøkkeladministrerings- og -signatursertifikat";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza-nøkkeladministreringssertifikat";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza-nøkkeladministrerings- og -signatursertifikat";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza-brukersignatursertifikat";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA-brukersignatursertifikat";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA-signatursertifikat";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Støttevektor";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Kvitteringskriterier";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Medlemskap";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administratorer";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKM-er";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMer";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKM-er";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMer";
"06 09 60 86 48 01 65 02 01 05 18"	= "maiUKM-er";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKM-er";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKM-er";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMer";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKM-er";
"06 09 60 86 48 01 65 02 01 05 1D"	= "oktUKMer";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMer";
"06 09 60 86 48 01 65 02 01 05 1F"	= "desUKMer";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS-signatur CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS-signatur CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS-sertifikattilbakekallingsliste";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza-sertifikattilbakekallingsliste";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Dispensert adresse-prosessor";
"06 09 60 86 48 01 65 02 01 05 30"	= "Beskytt";
"06 09 60 86 48 01 65 02 01 05 31"	= "Støttede algoritmer";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A-nøkkeladministreringssertifikat";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A-nøkkeladministrerings- og -signatursertifikat";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A-brukersignatursertifikat";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC-informasjon";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA-restriksjoner";
"06 09 60 86 48 01 65 02 01 05 37"	= "Signatur- eller nøkkeladministreringsprivilegier";
"06 09 60 86 48 01 65 02 01 05 38"	= "Comm-privilegier";
"06 09 60 86 48 01 65 02 01 05 39"	= "Attributt med etikett";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Kriterieinformasjonsfil";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Sec-kriterieinformasjonsfil";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA-klareringsrestriksjon";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP-tillegg";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI-sikkerhetskategorier";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standard sikkerhetsetikettprivilegier";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Signaturprivilegier";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Nøkkeladministeringsprivilegier";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Navngitt kodeinnstilling-privilegium";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Department of Defense Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Department of Defense Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Department of Defense Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Department of Defense Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Department of Defense PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Test sikkerhetskriterier";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 kodeinnstilling null";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 merkeinnstilling én";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 merkeinnstilling to";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 sikkerhetskategorier";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 merkeinnstilling null";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP21 merkeinnstilling én";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 merkeinnstilling to";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka-sikkerhetskategorier";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka merkeinnstillingsnavn 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka merkeinnstillingsnavn 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka merkeinnstillingsnavn 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Test CRL-innskriving";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etikett";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK-kriterieidentifikator";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA rudimentær kriterieidentifikator";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA basiskriterieidentifikator";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA middels-kriterieidentifikator";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA høy-kriterieidentifikator";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA-nøkkel";
"06 08 60 86 48 01 65 03 02 03"			= "Relatert";
"06 09 60 86 48 01 65 03 02 03 01"		= "Nøkkelgjenfinningsteknikk";
"06 09 60 86 48 01 65 03 02 03 02"		= "Kan utføre nøkkelgjenfinning";
"06 09 60 86 48 01 65 03 02 03 03"		= "Nøkkelgjenfinning";
"06 08 60 86 48 01 65 03 02 04"			= "Nøkkelgjenfinningssystem";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK-tillegg";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST-algoritme";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell-algoritme";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 med RSA-kryptering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 med RSA-kryptering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 med RSA-kryptering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM-sammendrag";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC med SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC med MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4-pakke";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA-kryptering BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW-passord";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI-attributtype";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Sikkerhetsattributter";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Pålitelighetsgrense";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape-objektidentifikator";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape-sertifikattillegg";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape-sertifikattype";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape-base-URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape-tilbakekallings-URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA-tilbakekallings-URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL-nedlastings-URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA-sertifikatnedlastings-URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape-sertifikatfornyelses-URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA-kriterie-URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL til Netscape-sertifikatstartside";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape-sertifikatinnskrivingslogo";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape-sertifikatbrukerbilde";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL Server-navn";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape-sertifikatkommentar";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape-datatyper";
"06 09 60 86 48 01 86 F8 42 02 01"	= "bilde/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "bilde/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "tekst/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape-sertifikatsekvens";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape-sertifikat-URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape Directory-objektidentifikator";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP-definisjoner";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Bil-lisens";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Avdelingsnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Ansatt-nummer";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Ansatt-type";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Organisasjonsperson på intranett";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Ukjent Verisign VPN-tillegg";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Ukjent Verisign VPN-tillegg";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign-kriterieidentifikator";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1-merknad";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Innholdstype";
"06 04 67 2A 00 00"	= "PAN-data";
"06 04 67 2A 00 01"	= "PAN-kjennetegn";
"06 04 67 2A 00 02"	= "Kun PAN";

"06 03 67 2A 01"	= "Meldingstillegg";
"06 03 67 2A 02"	= "Felt";
"06 04 67 2A 02 00"	= "Fullt navn";
"06 04 67 2A 02 01"	= "Fornavn";
"06 04 67 2A 02 02"	= "Etternavn";
"06 04 67 2A 02 03"	= "Etternavn ved fødsel";
"06 04 67 2A 02 04"	= "Stedsnavn";
"06 04 67 2A 02 05"	= "Identifiseringsnummer";
"06 04 67 2A 02 06"	= "Måned";
"06 04 67 2A 02 07"	= "Dato";
"06 04 67 2A 02 08"	= "Adresse";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Beløp";
"06 04 67 2A 02 0B"	= "Kontonummer";
"06 04 67 2A 02 0C"	= "Passordfrase";

"06 03 67 2A 03"		= "Attributt";
"06 04 67 2A 03 00"		= "Sertifikat";
"06 05 67 2A 03 00 00"	= "Rotnøkkeltommelavtrykk";
"06 05 67 2A 03 00 01"	= "Ekstra kriterier";

"06 03 67 2A 04"	= "Algoritme";
"06 03 67 2A 05"	= "Kriterier";
"06 04 67 2A 05 00"	= "Rot";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Sertifikattillegg";
"06 04 67 2A 07 00"	= "«Hashed» rotnøkkel";
"06 04 67 2A 07 01"	= "Sertifikattype";
"06 04 67 2A 07 02"	= "Forhandlerdata";
"06 04 67 2A 07 03"	= "Kortsert. kreves";
"06 04 67 2A 07 04"	= "Tunnellering";
"06 04 67 2A 07 05"	= "SET-tillegg";
"06 04 67 2A 07 06"	= "SET-kvalifikator";

"06 03 67 2A 08"	= "Merke";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Leverandør";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nasjonal";
"06 05 67 2A 0A E2 00"	= "Japan";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "«Hashed» rotnøkkel";
"06 04 86 8D 6F 03"	= "Sertifikattype";
"06 04 86 8D 6F 04"	= "Forhandlerdata";
"06 04 86 8D 6F 05"	= "Kortsertifikat kreves";
"06 04 86 8D 6F 06"	= "Tunnellering";
"06 04 86 8D 6F 07"	= "SET-kvalifikator";
"06 04 86 8D 6F 63"	= "SET-data";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple-datasikkerhet";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple-godkjenningskriterieidentifikator";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign-kriterier";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509-basiskriterier";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL-kriterier";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple-kriterier for lokal sertifikatgenerering";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple-kriterier for lokal sertifikatsigneringsforespørsler";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL-tilbakekallingskriterier";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP-tilbakekallingskriterier";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME-kriterier";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple-godkjenningstilleggskriterier";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple-kriterier for programvareoppdateringsignering";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec-kriterier";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat-kriterier";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple-kriterier for ressurssignering";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple-kriterier for Kerberos-klienter";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple-kriterier for Kerberos-tjenere";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple-kodesigneringskriterier";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple-kriterier for pakkesignering";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple-sikkerhetsalgoritmeidentifikator";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Fast Elliptic Encryption (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE med MD5-signatur";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE med SHA-1-signatur";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED Encryption";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (Eksperimentell)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE med ECDSA-signatur";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac Certificate Identifier";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac Certificate Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac Identity Cert Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac Email Signing Cert Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac Email Encryption Cert Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac Archive List Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac Archive Store Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac Archive Fetch Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac Archive Remove Request";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac Certificate Extension";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac Identity";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac Email Signing";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac Email Encryption";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac Certificate Request Value";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Brukernavn";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Passord";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Vertsnavn";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Forny flagg";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynchronous Flag";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple Extended Key Usage";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple Code Signing";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple Code Signing (Development)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple-programvareoppdateringsignering";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple-kodesignering (reservert)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple-ressurssignering";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat-signering";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat-kryptering";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple-systemidentitet";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple-sertifikatkriterier";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple-sertifikatkriterier";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple-sertifikatkriterier for .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Kodesignering";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA Security";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA Security Formats";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3-sertifikattillegg";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 personlige sertifikattillegg";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Signaturbitmap til subjekt";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Bilde av subjekt";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "E-postadresse til subjekt";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Bruk fritak";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA Security Algorithms";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 med ECDSA";

/* end */
